<a href="https://colab.research.google.com/github/riznazzahraF-create/Modul-Basis-Data/blob/main/BAB%205%20-%20modul%20basis%20data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**⌨ BAB 5 - DATA MANIPULATION LANGUAGE (DML)**
---

###**5.2 Test Awal**
**1. Cara memasukkan data ke tabel<br>**
Untuk memasukkan data ke tabel, digunakan perintah **INSERT INTO**.
Perintah ini menambahkan baris baru ke dalam tabel.

**Sintaks dasar**
```sql
INSERT INTO nama_tabel (kolom1, kolom2, kolom3)
VALUES (nilai1, nilai2, nilai3);
```

**Contoh penerapan**
```sql
INSERT INTO customer (id, nama_customer, alamat)
VALUES (1, 'Budi Santoso', 'Jl. Merdeka No. 10');
```

**2. Cara menghapus data dari tabel<br>**
Untuk menghapus data dari tabel, digunakan perintah **DELETE**

**Sintaks dasar**
```sql
DELETE FROM nama_tabel
WHERE kondisi;
```

**Contoh penerapan**
```sql
DELETE FROM customer
WHERE nama_customer = 'Siti Aminah';
```

---

##**5.3 Insert table**
- Perintahnya :
```sql
Insert Into Nama_Table Values (
    Isi_Field_1, Isi_Field_2, … , Isi_Field_N) ;
```
- Atau dengan perintah :
```sql
Insert Into Nama_Table (
    Nama_Field_1, Nama_Field_2, … , Nama_Field_N)
Values
    (Isi_Field_1, Isi_Field_2, … , Isi_Field_N) ;
```
- Contoh penggunaan pada skema order entry
```sql
mysql> Insert Into Mahasiswa Values
    (,'05052652','Paijo', 'Jalan Wates km 11');
```

---

##**5.4 QUERY  SEDERHANA**
Select merupakan perintah yang dapat digunakan untuk :
- Menampilkan data secara keseluruhan yang terdapat di dalam table.
- Menampilkan data tertentu yang terdapat di dalam table.
- Menampilkan dan mengurutkan data secara ascending dan descending
---

##**5.4.1 Menampilkan Data Secara Keseluruhan <br>**
Jika ingin menampilkan data data secara keseluruhan yang terdapat di dalam table, misalnya table
Mhs_2 secara keseluruhan.

- Perintahnya
```sql
Select * From Nama_Table;
```

- Contohnya
```sql
mysql> Select * From Mahasiwa;
```
---

##**5.5 UPDATE TABLE**
Update merupakan perintah yang dapat digunakan untuk  melakukan perubahan terhadap data yang sudah ada/dibuat.
- Perintahnya :
```sql
Update Nama_Table Set Nama_Field = 'Data_Baru'
    Where Nama_Field_Key = 'Data_Key';
```
- Contoh :
```sql
mysql> Update customers Set cust_address = 'Gejayan Yogya',cust_country=’INA’
    Where cust_id='10002';
```
---

##**5.6 DELETE DATA**
Delete merupakan perintah yang dapat digunakan untuk  menghapus data yang terdapat di dalam
tabel.
- Perintahnya :
```sql
Delete From Nama_Table Where Nama_Field_Key;
```
- Contoh :
```sql
mysql> Delete From Mhs_2 Where ID='5';
```
---

##**5.7 QUERY DENGAN KONDISI**
Query dengan perbandingan kondisi bentuk umumnya adalah sbb : <br>
```sql
Select * from Nama_Table where Kondisi;
```

_Operator Relasional <br>_

Operator relasional merupakan operator yang digunakan untuk membandingkan antara dua buah
nilai dalam suatu table.

| Operator | Keterangan                          |
|---------|---------------------------------------|
| =       | Sama dengan                           |
| >       | Lebih besar dari                      |
| <       | Lebih kecil dari                      |
| >=      | Lebih besar dari sama dengan          |
| <=      | Lebih kecil dari sama dengan          |
| <>      | Tidak sama dengan                     |

<br>

- Perintahnya
```sql
Select * From Nama_Table
    Where  Nama_Field [Operator Relasional] Ketentuan;
```

- Contoh
```sql
select * from customer where cust_id = ‘10003’ or cust_name =’wascals;
```